---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDiameter
source: html/ebf01d75-e4b6-328c-7053-902bedb05e09.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleDiameter Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleDiameter { get; }
```